dbFoam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    venkatakrishnan cellLimited<Venkatakrishnan> Gauss linear 1;
}

divSchemes
{
    default         none;

}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;

    //reconstruct(rho) vanLeer;
    //reconstruct(U)  vanLeerV;
    //reconstruct(T)  vanLeer;
    //reconstruct(p) linearUpwind  limitedGauss; //upwind;
    //reconstruct(U) linearUpwindV limitedGauss; //upwind;
    //reconstruct(T) linearUpwind  limitedGauss; //upwind;
    reconstruct(p)  Minmod 1;
    reconstruct(U)  Minmod 1;
    reconstruct(T)  Minmod 1;
    //reconstruct(p) linearUpwind  venkatakrishnan; 
    //reconstruct(U) linearUpwindV venkatakrishnan; 
    //reconstruct(T) linearUpwind  venkatakrishnan;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
