dbFoam/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U (0 0 0)
    volScalarFieldValue T 0.000034904
    volScalarFieldValue p 0.01
);

regions
(
    boxToCell
    {
        box (0.5 -0.1 -0.1) (1 0.1 0.1);
        fieldValues
        (
            volScalarFieldValue T 3.4904014
            volScalarFieldValue p 1000
        );
    }
);


// ************************************************************************* //
